In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [2]:
# Calculate the total number of schools
total_schools = len(school_data_complete["School ID"].unique())
total_schools

15

In [3]:
# Calculate the total number of students
total_students = len(school_data_complete["Student ID"].unique())
total_students

39170

In [4]:
# Calculate the total budget
total_budget = school_data["budget"].sum()
total_budget

24649428

In [5]:
# Calculate the average math score
avg_math_score = school_data_complete["math_score"].mean()
avg_math_score

78.98537145774827

In [6]:
# Calculate the average reading score
avg_reading_score = school_data_complete["reading_score"].mean()
avg_reading_score

81.87784018381414

In [7]:
# Create bins to place score values
bins = [0, 69, 100]

# Create labels for these bins
score_labels = ["Fail", "Pass"]

In [8]:
# Place the sliced bin data into new columns inside of the data, for math and reading
school_data_complete["Math Grade Group"] = pd.cut(school_data_complete["math_score"], bins, labels=score_labels)
school_data_complete["Reading Grade Group"] = pd.cut(school_data_complete["reading_score"], bins, labels=score_labels)
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget,Math Grade Group,Reading Grade Group
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635,Pass,Fail
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635,Fail,Pass
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635,Fail,Pass
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635,Fail,Fail
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635,Pass,Pass

In [9]:
# Create new df for just overall passing students
overall_pass_df = school_data_complete.loc[(school_data_complete["Math Grade Group"] == "Pass") &
                                          (school_data_complete["Reading Grade Group"] == "Pass")]
overall_pass_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget,Math Grade Group,Reading Grade Group
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635,Pass,Pass
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635,Pass,Pass
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635,Pass,Pass
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635,Pass,Pass
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635,Pass,Pass

In [10]:
# Isolate passing scores for math
pass_math = school_data_complete.loc[(
    school_data_complete["Math Grade Group"] == "Pass")]

# Calculate the percentage of students with a passing math score (70 or greater)
perc_pass_math = (pass_math["Student ID"].count() / total_students) * 100
perc_pass_math

74.9808526933878

In [11]:
# Isolate passing scores for reading
pass_reading = school_data_complete.loc[(
    school_data_complete["Reading Grade Group"] == "Pass")]

# Calculate the percentage of students with a passing reading score (70 or greater)
perc_pass_reading = (pass_reading["Student ID"].count() / total_students) * 100
perc_pass_reading

85.80546336482001

In [12]:
# Isolate overall passing scores, reading and math
pass_overall = school_data_complete.loc[(
    school_data_complete["Math Grade Group"] == "Pass") & 
    (school_data_complete["Reading Grade Group"] == "Pass")]

# Calculate the percentage of students who passed math and reading (% Overall Passing)
perc_pass_overall = (pass_overall["Student ID"].count() / total_students) * 100
perc_pass_overall

65.17232575950983

In [13]:
# Create a dataframe to hold the above results
district_summary_df = pd.DataFrame({
    "Total Schools": [total_schools], "Total Students": [total_students],
    "Total Budget": [total_budget], "Average Math Score": [avg_math_score],
    "Average Reading Score": [avg_reading_score], "% Passing Math": [perc_pass_math],
    "% Passing Reading": [perc_pass_reading], "% Overall Passing": [perc_pass_overall]
})
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [14]:
# Optional: give the displayed data cleaner formatting
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)
district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${0:,.2f}".format)
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.2f}".format)
district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.2f}".format)
district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.2f}".format)
district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.2f}".format)
district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.2f}".format)
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",78.99,81.88,74.98,85.81,65.17

In [15]:
# Using GroupBy in order to separate the data into fields according to different schools
grouped_school_df = school_data_complete.groupby(["school_name"])
grouped_school_df.count()

,Student ID,student_name,gender,grade,reading_score,math_score,School ID,type,size,budget,Math Grade Group,Reading Grade Group
school_name,,,,,,,,,,,,
Bailey High School,4976,4976,4976,4976,4976,4976,4976,4976,4976,4976,4976,4976
Cabrera High School,1858,1858,1858,1858,1858,1858,1858,1858,1858,1858,1858,1858
Figueroa High School,2949,2949,2949,2949,2949,2949,2949,2949,2949,2949,2949,2949
Ford High School,2739,2739,2739,2739,2739,2739,2739,2739,2739,2739,2739,2739
Griffin High School,1468,1468,1468,1468,1468,1468,1468,1468,1468,1468,1468,1468
Hernandez High School,4635,4635,4635,4635,4635,4635,4635,4635,4635,4635,4635,4635
Holden High School,427,427,427,427,427,427,427,427,427,427,427,427
Huang High School,2917,2917,2917,2917,2917,2917,2917,2917,2917,2917,2917,2917
Johnson High School,4761,4761,4761,4761,4761,4761,4761,4761,4761,4761,4761,4761
Pena High School,962,962,962,962,962,962,962,962,962,962,962,962
Rodriguez High School,3999,3999,3999,3999,3999,3999,3999,3999,3999,3999,3999,3999
Shelton High School,1761,1761,1761,1761,1761,1761,1761,1761,1761,1761,1761,1761
Thomas High School,1635,1635,1635,1635,1635,1635,1635,1635,1635,1635,1635,1635
Wilson High School,2283,2283,2283,2283,2283,2283,2283,2283,2283,2283,2283,2283
Wright High School,1800,1800,1800,1800,1800,1800,1800,1800,1800,1800,1800,1800

In [16]:
# Find School Type
school_type = grouped_school_df["type"].unique()
school_type

school_name
Bailey High School       [District]
Cabrera High School       [Charter]
Figueroa High School     [District]
Ford High School         [District]
Griffin High School       [Charter]
Hernandez High School    [District]
Holden High School        [Charter]
Huang High School        [District]
Johnson High School      [District]
Pena High School          [Charter]
Rodriguez High School    [District]
Shelton High School       [Charter]
Thomas High School        [Charter]
Wilson High School        [Charter]
Wright High School        [Charter]
Name: type, dtype: object

In [17]:
# Find total students per school
school_student_count = grouped_school_df["Student ID"].count()
school_student_count.head()

school_name
Bailey High School      4976
Cabrera High School     1858
Figueroa High School    2949
Ford High School        2739
Griffin High School     1468
Name: Student ID, dtype: int64

In [18]:
# Find Total School Budget
school_budget = grouped_school_df["budget"].mean()
school_budget

school_name
Bailey High School       3124928
Cabrera High School      1081356
Figueroa High School     1884411
Ford High School         1763916
Griffin High School       917500
Hernandez High School    3022020
Holden High School        248087
Huang High School        1910635
Johnson High School      3094650
Pena High School          585858
Rodriguez High School    2547363
Shelton High School      1056600
Thomas High School       1043130
Wilson High School       1319574
Wright High School       1049400
Name: budget, dtype: int64

In [19]:
# Find Per Student Budget
per_student_budget = school_budget / school_student_count
per_student_budget

school_name
Bailey High School       628.0
Cabrera High School      582.0
Figueroa High School     639.0
Ford High School         644.0
Griffin High School      625.0
Hernandez High School    652.0
Holden High School       581.0
Huang High School        655.0
Johnson High School      650.0
Pena High School         609.0
Rodriguez High School    637.0
Shelton High School      600.0
Thomas High School       638.0
Wilson High School       578.0
Wright High School       583.0
dtype: float64

In [20]:
# Find Average Math Score
school_avg_math_score = grouped_school_df["math_score"].mean()
school_avg_math_score

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [21]:
# Find Average Reading Score
school_avg_reading_score = grouped_school_df["reading_score"].mean()
school_avg_reading_score

school_name
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
Thomas High School       83.848930
Wilson High School       83.989488
Wright High School       83.955000
Name: reading_score, dtype: float64

In [22]:
# Count how many of pass values for each school and create DataFrame
pass_math_df = pd.DataFrame(grouped_school_df["Math Grade Group"].value_counts())

# Rename the "Math Grade Group" column to "Math Counts"
pass_math_df = pass_math_df.rename(
    columns={"Math Grade Group": "Math Counts"})

# Reset the index of "pass_math_df" so that includes all columns
pass_math_df = pass_math_df.reset_index()

# Isolate passing scores for math
sch_pass_math = pass_math_df.loc[(
    pass_math_df["Math Grade Group"] == "Pass")]

# Merge the "school_student_count" into the DataFrame
sch_pass_math = sch_pass_math.merge(school_student_count, on="school_name")

# Add column for % passed
sch_pass_math["% Passed Math"] = (sch_pass_math["Math Counts"] / sch_pass_math["Student ID"]) * 100
sch_pass_math.head()

,school_name,Math Grade Group,Math Counts,Student ID,% Passed Math
0,Bailey High School,Pass,3318,4976,66.680064
1,Cabrera High School,Pass,1749,1858,94.133477
2,Figueroa High School,Pass,1946,2949,65.988471
3,Ford High School,Pass,1871,2739,68.309602
4,Griffin High School,Pass,1371,1468,93.392371

In [23]:
# Condense sch_pass_math df to basic categories
sch_pass_math_df = sch_pass_math.drop(columns=["Math Grade Group", "Math Counts", "Student ID"])
sch_pass_math_df.head()

            school_name  % Passed Math
0    Bailey High School      66.680064
1   Cabrera High School      94.133477
2  Figueroa High School      65.988471
3      Ford High School      68.309602
4   Griffin High School      93.392371

In [24]:
# Count how many of pass values for each school and create DataFrame, for reading
pass_rdg_df = pd.DataFrame(grouped_school_df["Reading Grade Group"].value_counts())

# Rename the "Reading Grade Group" column to "Reading Counts"
pass_rdg_df = pass_rdg_df.rename(
    columns={"Reading Grade Group": "Reading Counts"})

# Reset the index of "pass_rdg_df" so that includes all columns
pass_rdg_df = pass_rdg_df.reset_index()

# Isolate passing scores for reading
sch_pass_rdg = pass_rdg_df.loc[(
    pass_rdg_df["Reading Grade Group"] == "Pass")]

# Merge the "school_student_count" into the DataFrame
sch_pass_rdg = sch_pass_rdg.merge(school_student_count, on="school_name")

# Add column for % passed
sch_pass_rdg["% Passed Rdg"] = (sch_pass_rdg["Reading Counts"] / sch_pass_rdg["Student ID"]) * 100
sch_pass_rdg.head()

,school_name,Reading Grade Group,Reading Counts,Student ID,% Passed Rdg
0,Bailey High School,Pass,4077,4976,81.933280
1,Cabrera High School,Pass,1803,1858,97.039828
2,Figueroa High School,Pass,2381,2949,80.739234
3,Ford High School,Pass,2172,2739,79.299014
4,Griffin High School,Pass,1426,1468,97.138965

In [25]:
# Condense sch_pass_rdg df to basic categories
sch_pass_rdg_df = sch_pass_rdg.drop(columns=["Reading Grade Group", "Reading Counts", "Student ID"])
sch_pass_rdg_df.head()

            school_name  % Passed Rdg
0    Bailey High School     81.933280
1   Cabrera High School     97.039828
2  Figueroa High School     80.739234
3      Ford High School     79.299014
4   Griffin High School     97.138965

In [26]:
# Using GroupBy in order to separate the overall pass data into fields according to different schools
grouped_school_pass_df = overall_pass_df.groupby(["school_name"])
grouped_school_pass_df.count()

,Student ID,student_name,gender,grade,reading_score,math_score,School ID,type,size,budget,Math Grade Group,Reading Grade Group
school_name,,,,,,,,,,,,
Bailey High School,2719,2719,2719,2719,2719,2719,2719,2719,2719,2719,2719,2719
Cabrera High School,1697,1697,1697,1697,1697,1697,1697,1697,1697,1697,1697,1697
Figueroa High School,1569,1569,1569,1569,1569,1569,1569,1569,1569,1569,1569,1569
Ford High School,1487,1487,1487,1487,1487,1487,1487,1487,1487,1487,1487,1487
Griffin High School,1330,1330,1330,1330,1330,1330,1330,1330,1330,1330,1330,1330
Hernandez High School,2481,2481,2481,2481,2481,2481,2481,2481,2481,2481,2481,2481
Holden High School,381,381,381,381,381,381,381,381,381,381,381,381
Huang High School,1561,1561,1561,1561,1561,1561,1561,1561,1561,1561,1561,1561
Johnson High School,2549,2549,2549,2549,2549,2549,2549,2549,2549,2549,2549,2549
Pena High School,871,871,871,871,871,871,871,871,871,871,871,871
Rodriguez High School,2119,2119,2119,2119,2119,2119,2119,2119,2119,2119,2119,2119
Shelton High School,1583,1583,1583,1583,1583,1583,1583,1583,1583,1583,1583,1583
Thomas High School,1487,1487,1487,1487,1487,1487,1487,1487,1487,1487,1487,1487
Wilson High School,2068,2068,2068,2068,2068,2068,2068,2068,2068,2068,2068,2068
Wright High School,1626,1626,1626,1626,1626,1626,1626,1626,1626,1626,1626,1626

In [27]:
# Turn into dataframe
pass_all_df = pd.DataFrame(grouped_school_pass_df["size"].value_counts())
pass_all_df.head()

                           size
school_name          size
Bailey High School   4976  2719
Cabrera High School  1858  1697
Figueroa High School 2949  1569
Ford High School     2739  1487
Griffin High School  1468  1330

In [28]:
# Rename the "Reading Grade Group" column to "Reading Counts"
pass_all_df = pass_all_df.rename(
    columns={"size": "# Passed"})
pass_all_df.head()

                           # Passed
school_name          size
Bailey High School   4976      2719
Cabrera High School  1858      1697
Figueroa High School 2949      1569
Ford High School     2739      1487
Griffin High School  1468      1330

In [29]:
# Reset the index of "pass_all_df" so that includes all columns
pass_all_df = pass_all_df.reset_index()
pass_all_df

              school_name  size  # Passed
0      Bailey High School  4976      2719
1     Cabrera High School  1858      1697
2    Figueroa High School  2949      1569
3        Ford High School  2739      1487
4     Griffin High School  1468      1330
5   Hernandez High School  4635      2481
6      Holden High School   427       381
7       Huang High School  2917      1561
8     Johnson High School  4761      2549
9        Pena High School   962       871
10  Rodriguez High School  3999      2119
11    Shelton High School  1761      1583
12     Thomas High School  1635      1487
13     Wilson High School  2283      2068
14     Wright High School  1800      1626

In [30]:
# Add column for % passed
pass_all_df["% Passed Overall"] = (pass_all_df["# Passed"] / pass_all_df["size"]) * 100
pass_all_df.head()

            school_name  size  # Passed  % Passed Overall
0    Bailey High School  4976      2719         54.642283
1   Cabrera High School  1858      1697         91.334769
2  Figueroa High School  2949      1569         53.204476
3      Ford High School  2739      1487         54.289887
4   Griffin High School  1468      1330         90.599455

In [31]:
# Condense pass_all_df to basic categories
sch_pass_all_df = pass_all_df.drop(columns=["size", "# Passed"])
sch_pass_all_df.head()

            school_name  % Passed Overall
0    Bailey High School         54.642283
1   Cabrera High School         91.334769
2  Figueroa High School         53.204476
3      Ford High School         54.289887
4   Griffin High School         90.599455

In [32]:
# Group data by school and school type
grouped_school_type = school_data_complete.groupby(["school_name", "type"])
grouped_school_type.count()

,,Student ID,student_name,gender,grade,reading_score,math_score,School ID,size,budget,Math Grade Group,Reading Grade Group
school_name,type,,,,,,,,,,,
Bailey High School,District,4976,4976,4976,4976,4976,4976,4976,4976,4976,4976,4976
Cabrera High School,Charter,1858,1858,1858,1858,1858,1858,1858,1858,1858,1858,1858
Figueroa High School,District,2949,2949,2949,2949,2949,2949,2949,2949,2949,2949,2949
Ford High School,District,2739,2739,2739,2739,2739,2739,2739,2739,2739,2739,2739
Griffin High School,Charter,1468,1468,1468,1468,1468,1468,1468,1468,1468,1468,1468
Hernandez High School,District,4635,4635,4635,4635,4635,4635,4635,4635,4635,4635,4635
Holden High School,Charter,427,427,427,427,427,427,427,427,427,427,427
Huang High School,District,2917,2917,2917,2917,2917,2917,2917,2917,2917,2917,2917
Johnson High School,District,4761,4761,4761,4761,4761,4761,4761,4761,4761,4761,4761
Pena High School,Charter,962,962,962,962,962,962,962,962,962,962,962
Rodriguez High School,District,3999,3999,3999,3999,3999,3999,3999,3999,3999,3999,3999
Shelton High School,Charter,1761,1761,1761,1761,1761,1761,1761,1761,1761,1761,1761
Thomas High School,Charter,1635,1635,1635,1635,1635,1635,1635,1635,1635,1635,1635
Wilson High School,Charter,2283,2283,2283,2283,2283,2283,2283,2283,2283,2283,2283
Wright High School,Charter,1800,1800,1800,1800,1800,1800,1800,1800,1800,1800,1800

In [33]:
# Turn into dataframe
grouped_school_type_df = pd.DataFrame(grouped_school_type["School ID"].value_counts())
grouped_school_type_df

                                          School ID
school_name           type     School ID
Bailey High School    District 7               4976
Cabrera High School   Charter  6               1858
Figueroa High School  District 1               2949
Ford High School      District 13              2739
Griffin High School   Charter  4               1468
Hernandez High School District 3               4635
Holden High School    Charter  8                427
Huang High School     District 0               2917
Johnson High School   District 12              4761
Pena High School      Charter  9                962
Rodriguez High School District 11              3999
Shelton High School   Charter  2               1761
Thomas High School    Charter  14              1635
Wilson High School    Charter  5               2283
Wright High School    Charter  10              1800

In [34]:
# Rename the "School ID" column to "Student Counts"
grouped_school_type_df = grouped_school_type_df.rename(
    columns={"School ID": "Student Counts"})
grouped_school_type_df.head()

                                         Student Counts
school_name          type     School ID
Bailey High School   District 7                    4976
Cabrera High School  Charter  6                    1858
Figueroa High School District 1                    2949
Ford High School     District 13                   2739
Griffin High School  Charter  4                    1468

In [35]:
# Reset the index of "pass_all_df" so that includes all columns
grouped_school_type_df = grouped_school_type_df.reset_index()
grouped_school_type_df

              school_name      type  School ID  Student Counts
0      Bailey High School  District          7            4976
1     Cabrera High School   Charter          6            1858
2    Figueroa High School  District          1            2949
3        Ford High School  District         13            2739
4     Griffin High School   Charter          4            1468
5   Hernandez High School  District          3            4635
6      Holden High School   Charter          8             427
7       Huang High School  District          0            2917
8     Johnson High School  District         12            4761
9        Pena High School   Charter          9             962
10  Rodriguez High School  District         11            3999
11    Shelton High School   Charter          2            1761
12     Thomas High School   Charter         14            1635
13     Wilson High School   Charter          5            2283
14     Wright High School   Charter         10            1800

In [36]:
# Create new DataFrame for school_budget
school_budget_df = pd.DataFrame(school_budget)
school_budget_df.head()

                       budget
school_name
Bailey High School    3124928
Cabrera High School   1081356
Figueroa High School  1884411
Ford High School      1763916
Griffin High School    917500

In [37]:
# Re-set index for data frame
school_budget_df = school_budget_df.reset_index()
school_budget_df.head()

            school_name   budget
0    Bailey High School  3124928
1   Cabrera High School  1081356
2  Figueroa High School  1884411
3      Ford High School  1763916
4   Griffin High School   917500

In [38]:
# Merge school_budget_df into grouped_school_type_df
grouped_school_type_df = pd.merge(grouped_school_type_df, school_budget_df, on="school_name")
grouped_school_type_df

              school_name      type  School ID  Student Counts   budget
0      Bailey High School  District          7            4976  3124928
1     Cabrera High School   Charter          6            1858  1081356
2    Figueroa High School  District          1            2949  1884411
3        Ford High School  District         13            2739  1763916
4     Griffin High School   Charter          4            1468   917500
5   Hernandez High School  District          3            4635  3022020
6      Holden High School   Charter          8             427   248087
7       Huang High School  District          0            2917  1910635
8     Johnson High School  District         12            4761  3094650
9        Pena High School   Charter          9             962   585858
10  Rodriguez High School  District         11            3999  2547363
11    Shelton High School   Charter          2            1761  1056600
12     Thomas High School   Charter         14            1635  1043130
13     Wilson High School   Charter          5            2283  1319574
14     Wright High School   Charter         10            1800  1049400

In [39]:
# Add per student budget to grouped_school_type
# Create new DataFrame for per_student_budget
per_student_budget_df = pd.DataFrame(per_student_budget)

# Re-set index for data frame
per_student_budget_df = per_student_budget_df.reset_index()

# Merge per_student_budget_df into grouped_school_type_df
grouped_school_type_df = pd.merge(grouped_school_type_df, per_student_budget_df, on="school_name")
grouped_school_type_df.head()

            school_name      type  School ID  Student Counts   budget      0
0    Bailey High School  District          7            4976  3124928  628.0
1   Cabrera High School   Charter          6            1858  1081356  582.0
2  Figueroa High School  District          1            2949  1884411  639.0
3      Ford High School  District         13            2739  1763916  644.0
4   Griffin High School   Charter          4            1468   917500  625.0

In [40]:
# Add Average Math Score to grouped_school_type
# Create new DataFrame for school_avg_math_score
school_avg_math_score_df = pd.DataFrame(school_avg_math_score)

# Re-set index for data frame
school_avg_math_score_df = school_avg_math_score_df.reset_index()

# Merge per_student_budget_df into grouped_school_type_df
grouped_school_type_df = pd.merge(grouped_school_type_df, school_avg_math_score_df, on="school_name")
grouped_school_type_df.head()

,school_name,type,School ID,Student Counts,budget,0,math_score
0,Bailey High School,District,7,4976,3124928,628.0,77.048432
1,Cabrera High School,Charter,6,1858,1081356,582.0,83.061895
2,Figueroa High School,District,1,2949,1884411,639.0,76.711767
3,Ford High School,District,13,2739,1763916,644.0,77.102592
4,Griffin High School,Charter,4,1468,917500,625.0,83.351499

In [41]:
# Add Average Reading Score to grouped_school_type
# Create new DataFrame for school_avg_reading_score
school_avg_reading_score_df = pd.DataFrame(school_avg_reading_score)

# Re-set index for data frame
school_avg_reading_score_df = school_avg_reading_score_df.reset_index()

# Merge per_student_budget_df into grouped_school_type_df
grouped_school_type_df = pd.merge(grouped_school_type_df, school_avg_reading_score_df, on="school_name")
grouped_school_type_df.head()

,school_name,type,School ID,Student Counts,budget,0,math_score,reading_score
0,Bailey High School,District,7,4976,3124928,628.0,77.048432,81.033963
1,Cabrera High School,Charter,6,1858,1081356,582.0,83.061895,83.975780
2,Figueroa High School,District,1,2949,1884411,639.0,76.711767,81.158020
3,Ford High School,District,13,2739,1763916,644.0,77.102592,80.746258
4,Griffin High School,Charter,4,1468,917500,625.0,83.351499,83.816757

In [42]:
# Add % Passing Math to grouped_school_type
# Merge sch_pass_math_df into grouped_school_type_df
grouped_school_type_df = pd.merge(grouped_school_type_df, sch_pass_math_df, on="school_name")
grouped_school_type_df.head()

,school_name,type,School ID,Student Counts,budget,0,math_score,reading_score,% Passed Math
0,Bailey High School,District,7,4976,3124928,628.0,77.048432,81.033963,66.680064
1,Cabrera High School,Charter,6,1858,1081356,582.0,83.061895,83.975780,94.133477
2,Figueroa High School,District,1,2949,1884411,639.0,76.711767,81.158020,65.988471
3,Ford High School,District,13,2739,1763916,644.0,77.102592,80.746258,68.309602
4,Griffin High School,Charter,4,1468,917500,625.0,83.351499,83.816757,93.392371

In [43]:
# Add % Passing Reading to grouped_school_type
# Merge sch_pass_rdg_df into grouped_school_type_df
grouped_school_type_df = pd.merge(grouped_school_type_df, sch_pass_rdg_df, on="school_name")
grouped_school_type_df.head()

,school_name,type,School ID,Student Counts,budget,0,math_score,reading_score,% Passed Math,% Passed Rdg
0,Bailey High School,District,7,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280
1,Cabrera High School,Charter,6,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828
2,Figueroa High School,District,1,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234
3,Ford High School,District,13,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014
4,Griffin High School,Charter,4,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965

In [44]:
# Add % Overall Passing to grouped_school_type
# Merge sch_pass_all_df into grouped_school_type_df
grouped_school_type_df = pd.merge(grouped_school_type_df, sch_pass_all_df, on="school_name")
grouped_school_type_df.head()

,school_name,type,School ID,Student Counts,budget,0,math_score,reading_score,% Passed Math,% Passed Rdg,% Passed Overall
0,Bailey High School,District,7,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280,54.642283
1,Cabrera High School,Charter,6,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,91.334769
2,Figueroa High School,District,1,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,53.204476
3,Ford High School,District,13,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,54.289887
4,Griffin High School,Charter,4,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,90.599455

In [45]:
# Remove School Id column
grouped_school_type_df = grouped_school_type_df.drop(columns=["School ID"])
grouped_school_type_df.head()

,school_name,type,Student Counts,budget,0,math_score,reading_score,% Passed Math,% Passed Rdg,% Passed Overall
0,Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280,54.642283
1,Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,91.334769
2,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,53.204476
3,Ford High School,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,54.289887
4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,90.599455

In [46]:
# Rename columns; had to use 0 (not in quotes) for unnamed column
final_school_summary = grouped_school_type_df.rename(columns={"school_name": "School Name", "type": "School Type", 
                                      "Student Counts": "Total Students", "budget": "Total School Budget", 
                                      0: "Per Student Budget", "math_score": "Average Math Score", 
                                      "reading_score": "Average Reading Score", "% Passed Math": "% Passing Math", 
                                      "% Passed Rdg": "% Passing Reading", "% Passed Overall": "% Overall Passing"})
final_school_summary.head()

,School Name,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280,54.642283
1,Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,91.334769
2,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,53.204476
3,Ford High School,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,54.289887
4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,90.599455

In [47]:
# Make copy of this to be able to use numerica data later before formatting column
final_school_sum_copy = final_school_summary.copy()
final_school_sum_copy.head()

,School Name,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280,54.642283
1,Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,91.334769
2,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,53.204476
3,Ford High School,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,54.289887
4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,90.599455

In [48]:
# Format Total School Budget and Per Student Budget for currency
final_school_summary["Total School Budget"] = final_school_summary["Total School Budget"].map("${0:,.2f}".format)
final_school_summary["Per Student Budget"] = final_school_summary["Per Student Budget"].map("${0:,.2f}".format)
final_school_summary.head()

,School Name,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,Bailey High School,District,4976,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,54.642283
1,Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769
2,Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476
3,Ford High School,District,2739,"$1,763,916.00",$644.00,77.102592,80.746258,68.309602,79.299014,54.289887
4,Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455

In [49]:
# Sort and display the top five performing schools by % overall passing.
# Sort the DataFrame by the values in the "% Overall Passing" column to find the best
# To sort from highest to lowest, ascending=False must be passed in
top_pass = final_school_summary.sort_values("% Overall Passing", ascending=False)

# Reset the index so that the index is now based on the sorting locations
top_pass = top_pass.reset_index(drop=True)
top_pass.head()

,School Name,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769
1,Thomas High School,Charter,1635,"$1,043,130.00",$638.00,83.418349,83.848930,93.272171,97.308869,90.948012
2,Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455
3,Wilson High School,Charter,2283,"$1,319,574.00",$578.00,83.274201,83.989488,93.867718,96.539641,90.582567
4,Pena High School,Charter,962,"$585,858.00",$609.00,83.839917,84.044699,94.594595,95.945946,90.540541

In [50]:
# Sort and display the five worst-performing schools by % overall passing.
# Sort the DataFrame by the values in the "% Overall Passing" column to find the worst
worst_pass = final_school_summary.sort_values("% Overall Passing")

# Reset the index so that the index is now based on the sorting locations
worst_pass = worst_pass.reset_index(drop=True)
worst_pass.head()

,School Name,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,Rodriguez High School,District,3999,"$2,547,363.00",$637.00,76.842711,80.744686,66.366592,80.220055,52.988247
1,Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476
2,Huang High School,District,2917,"$1,910,635.00",$655.00,76.629414,81.182722,65.683922,81.316421,53.513884
3,Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.289752,80.934412,66.752967,80.862999,53.527508
4,Johnson High School,District,4761,"$3,094,650.00",$650.00,77.072464,80.966394,66.057551,81.222432,53.539172

In [51]:
# Create a table that lists the average Math Score for students of each grade level (9th, 10th, 11th, 12th) 
# at each school.

# Create a pandas series for each grade. Hint: use a conditional statement.
ninth_grade = school_data_complete.loc[(school_data_complete["grade"] == "9th")]
tenth_grade = school_data_complete.loc[(school_data_complete["grade"] == "10th")]
eleventh_grade = school_data_complete.loc[(school_data_complete["grade"] == "11th")]
twelvth_grade = school_data_complete.loc[(school_data_complete["grade"] == "12th")]

# Group each table by school_name
grp_nine = ninth_grade.groupby(["school_name"])
grp_ten = tenth_grade.groupby(["school_name"])
grp_eleven = eleventh_grade.groupby(["school_name"])
grp_twelve = twelvth_grade.groupby(["school_name"])
grp_nine.count()

,Student ID,student_name,gender,grade,reading_score,math_score,School ID,type,size,budget,Math Grade Group,Reading Grade Group
school_name,,,,,,,,,,,,
Bailey High School,1458,1458,1458,1458,1458,1458,1458,1458,1458,1458,1458,1458
Cabrera High School,528,528,528,528,528,528,528,528,528,528,528,528
Figueroa High School,856,856,856,856,856,856,856,856,856,856,856,856
Ford High School,833,833,833,833,833,833,833,833,833,833,833,833
Griffin High School,409,409,409,409,409,409,409,409,409,409,409,409
Hernandez High School,1382,1382,1382,1382,1382,1382,1382,1382,1382,1382,1382,1382
Holden High School,127,127,127,127,127,127,127,127,127,127,127,127
Huang High School,844,844,844,844,844,844,844,844,844,844,844,844
Johnson High School,1400,1400,1400,1400,1400,1400,1400,1400,1400,1400,1400,1400
Pena High School,275,275,275,275,275,275,275,275,275,275,275,275
Rodriguez High School,1164,1164,1164,1164,1164,1164,1164,1164,1164,1164,1164,1164
Shelton High School,530,530,530,530,530,530,530,530,530,530,530,530
Thomas High School,461,461,461,461,461,461,461,461,461,461,461,461
Wilson High School,631,631,631,631,631,631,631,631,631,631,631,631
Wright High School,510,510,510,510,510,510,510,510,510,510,510,510

In [52]:
# Find average math scores
nine_avg_math = grp_nine["math_score"].mean()
ten_avg_math = grp_ten["math_score"].mean()
eleven_avg_math = grp_eleven["math_score"].mean()
twelve_avg_math = grp_twelve["math_score"].mean()
nine_avg_math

school_name
Bailey High School       77.083676
Cabrera High School      83.094697
Figueroa High School     76.403037
Ford High School         77.361345
Griffin High School      82.044010
Hernandez High School    77.438495
Holden High School       83.787402
Huang High School        77.027251
Johnson High School      77.187857
Pena High School         83.625455
Rodriguez High School    76.859966
Shelton High School      83.420755
Thomas High School       83.590022
Wilson High School       83.085578
Wright High School       83.264706
Name: math_score, dtype: float64

In [53]:
# Create data frames for each grade
nine_avg_math_df = pd.DataFrame(nine_avg_math)
ten_avg_math_df = pd.DataFrame(ten_avg_math)
eleven_avg_math_df = pd.DataFrame(eleven_avg_math)
twelve_avg_math_df = pd.DataFrame(twelve_avg_math)

# Re-set index for data frame
nine_avg_math_df = nine_avg_math_df.reset_index()
ten_avg_math_df = ten_avg_math_df.reset_index()
eleven_avg_math_df = eleven_avg_math_df.reset_index()
twelve_avg_math_df = twelve_avg_math_df.reset_index()

nine_avg_math_df.head()

            school_name  math_score
0    Bailey High School   77.083676
1   Cabrera High School   83.094697
2  Figueroa High School   76.403037
3      Ford High School   77.361345
4   Griffin High School   82.044010

In [54]:
# Merge other grades into ninth grade df and rename columns
avg_math_df = pd.merge(nine_avg_math_df, ten_avg_math_df, on="school_name")
avg_math_df = avg_math_df.rename(columns={"math_score_x": "9th"})
avg_math_df = avg_math_df.rename(columns={"math_score_y": "10th"})
avg_math_df = pd.merge(avg_math_df, eleven_avg_math_df, on="school_name")
avg_math_df = avg_math_df.rename(columns={"math_score": "11th"})
avg_math_df = pd.merge(avg_math_df, twelve_avg_math_df, on="school_name")
avg_math_df = avg_math_df.rename(columns={"math_score": "12th"})

avg_math_df

              school_name        9th       10th       11th       12th
0      Bailey High School  77.083676  76.996772  77.515588  76.492218
1     Cabrera High School  83.094697  83.154506  82.765560  83.277487
2    Figueroa High School  76.403037  76.539974  76.884344  77.151369
3        Ford High School  77.361345  77.672316  76.918058  76.179963
4     Griffin High School  82.044010  84.229064  83.842105  83.356164
5   Hernandez High School  77.438495  77.337408  77.136029  77.186567
6      Holden High School  83.787402  83.429825  85.000000  82.855422
7       Huang High School  77.027251  75.908735  76.446602  77.225641
8     Johnson High School  77.187857  76.691117  77.491653  76.863248
9        Pena High School  83.625455  83.372000  84.328125  84.121547
10  Rodriguez High School  76.859966  76.612500  76.395626  77.690748
11    Shelton High School  83.420755  82.917411  83.383495  83.778976
12     Thomas High School  83.590022  83.087886  83.498795  83.497041
13     Wilson High School  83.085578  83.724422  83.195326  83.035794
14     Wright High School  83.264706  84.010288  83.836782  83.644986

In [55]:
# Perform the same operations as above for reading scores
# Find average reading scores
nine_avg_rdg = grp_nine["reading_score"].mean()
ten_avg_rdg = grp_ten["reading_score"].mean()
eleven_avg_rdg = grp_eleven["reading_score"].mean()
twelve_avg_rdg = grp_twelve["reading_score"].mean()

# Create data frames for each grade
nine_avg_rdg_df = pd.DataFrame(nine_avg_rdg)
ten_avg_rdg_df = pd.DataFrame(ten_avg_rdg)
eleven_avg_rdg_df = pd.DataFrame(eleven_avg_rdg)
twelve_avg_rdg_df = pd.DataFrame(twelve_avg_rdg)

# Re-set index for data frame
nine_avg_rdg_df = nine_avg_rdg_df.reset_index()
ten_avg_rdg_df = ten_avg_rdg_df.reset_index()
eleven_avg_rdg_df = eleven_avg_rdg_df.reset_index()
twelve_avg_rdg_df = twelve_avg_rdg_df.reset_index()

# Merge other grades into ninth grade df and rename columns
avg_rdg_df = pd.merge(nine_avg_rdg_df, ten_avg_rdg_df, on="school_name")
avg_rdg_df = avg_rdg_df.rename(columns={"reading_score_x": "9th"})
avg_rdg_df = avg_rdg_df.rename(columns={"reading_score_y": "10th"})
avg_rdg_df = pd.merge(avg_rdg_df, eleven_avg_rdg_df, on="school_name")
avg_rdg_df = avg_rdg_df.rename(columns={"reading_score": "11th"})
avg_rdg_df = pd.merge(avg_rdg_df, twelve_avg_rdg_df, on="school_name")
avg_rdg_df = avg_rdg_df.rename(columns={"reading_score": "12th"})

avg_rdg_df

              school_name        9th       10th       11th       12th
0      Bailey High School  81.303155  80.907183  80.945643  80.912451
1     Cabrera High School  83.676136  84.253219  83.788382  84.287958
2    Figueroa High School  81.198598  81.408912  80.640339  81.384863
3        Ford High School  80.632653  81.262712  80.403642  80.662338
4     Griffin High School  83.369193  83.706897  84.288089  84.013699
5   Hernandez High School  80.866860  80.660147  81.396140  80.857143
6      Holden High School  83.677165  83.324561  83.815534  84.698795
7       Huang High School  81.290284  81.512386  81.417476  80.305983
8     Johnson High School  81.260714  80.773431  80.616027  81.227564
9        Pena High School  83.807273  83.612000  84.335938  84.591160
10  Rodriguez High School  80.993127  80.629808  80.864811  80.376426
11    Shelton High School  84.122642  83.441964  84.373786  82.781671
12     Thomas High School  83.728850  84.254157  83.585542  83.831361
13     Wilson High School  83.939778  84.021452  83.764608  84.317673
14     Wright High School  83.833333  83.812757  84.156322  84.073171

In [59]:
# Create a table that breaks down school performances based on average Spending Ranges (Per Student).
#I'm thinking it makes sense to use final_school_summary df

# Use 4 reasonable bins to group school spending; add to df 
# Create bins to place per student spending values
spending_bins = [0, 583, 629, 644, 675]

# Create labels for these bins
spending_labels = ["<$584", "$585-629", "$630-644", "$645-675"]

# Place the sliced bin data into new column inside of the data
#need to change per student budget back to int for this to run
final_school_sum_copy["Spending Ranges (Per Student)"] = pd.cut(final_school_sum_copy["Per Student Budget"], 
                                                                spending_bins, labels=spending_labels)
#school_data_complete["Math Grade Group"] = pd.cut(school_data_complete["math_score"], bins, labels=score_labels)
final_school_sum_copy.head()

# Include Average Math Score as column

# Include Average Reading Score as column

# Include % Passing Math as column

# Include % Passing Reading as column

# Include Overall Passing Rate (Average of the above two?) as column

,School Name,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing,Spending Ranges (Per Student)
0,Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280,54.642283,$585-629
1,Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,91.334769,<$584
2,Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,53.204476,$630-644
3,Ford High School,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,54.289887,$630-644
4,Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,90.599455,$585-629